---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPerforationsSize
source: html/e5c1144a-ff2f-078e-c29c-db433a75fe56.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPerforationsSize Property

The property labeled "Diameter/Size" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPerforationsSize { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" with a minimum of "0.0001".